Revit 2024 API
PointCloudOverrides.SetPointCloudScanOverrideSettings Method
Overload List
Name | Description
SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings)
 Assigns scan override settings to the whole PointCloudInstance element.
SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document)
 Assigns scan override settings to a particular scan within a PointCloudInstance element.
See Also
PointCloudOverrides Class
PointCloudOverrides Members
Autodesk.Revit.DB.PointClouds Namespace